{
  "config": {
    "step": {
      "user": {
        "title": "Fritz!Box VPN Konfiguration",
        "description": "Bitte geben Sie die Verbindungsdaten für Ihre FritzBox ein. Falls bereits eine FritzBox-Integration konfiguriert ist, werden die Daten automatisch übernommen.",
        "data": {
          "host": "FritzBox IP-Adresse",
          "username": "Benutzername",
          "password": "Passwort"
        }
      },
      "confirm": {
        "title": "Fritz!Box VPN gefunden",
        "description": "Eine FritzBox wurde automatisch gefunden: {host}. Bitte bestätigen Sie die Konfiguration."
      }
    },
    "error": {
      "cannot_connect": "Verbindung zur FritzBox fehlgeschlagen. Bitte überprüfen Sie die IP-Adresse und Netzwerkverbindung.",
      "invalid_auth": "Authentifizierung fehlgeschlagen. Bitte überprüfen Sie Benutzername und Passwort. Falls die Anmeldedaten korrekt sind, aktivieren Sie TR-064 (Zugriff für Apps erlauben) in der FritzBox unter Heimnetz > Netzwerk > Netzwerkeinstellungen > Zugriffseinstellungen im Heimnetz. Hinweis: UPnP wird nur für die automatische Erkennung benötigt, nicht für die API-Zugriffe.",
      "unknown": "Ein unerwarteter Fehler ist aufgetreten. Bitte überprüfen Sie die Home Assistant Logs für Details. Stellen Sie sicher, dass TR-064 (Zugriff für Apps erlauben) in der FritzBox aktiviert ist.",
      "config_entry_not_found": "Konfigurationseintrag nicht gefunden. Bitte die Integration erneut hinzufügen."
    },
    "abort": {
      "already_configured": "Diese FritzBox ist bereits konfiguriert.",
      "not_fritzbox": "Das gefundene Gerät ist keine FritzBox.",
      "no_host": "Die IP-Adresse konnte nicht ermittelt werden."
    }
  },
  "options": {
    "step": {
      "init": {
        "title": "Fritz!Box VPN Optionen",
        "description": "Aktualisieren Sie die FritzBox-Verbindungsdaten. Das Passwort-Feld wird aus Sicherheitsgründen nicht angezeigt. Lassen Sie es leer, um das aktuelle Passwort beizubehalten, oder geben Sie ein neues Passwort ein, um es zu ändern.",
        "data": {
          "host": "FritzBox IP-Adresse",
          "username": "Benutzername",
          "password": "Passwort (leer lassen, um aktuelles Passwort beizubehalten)",
          "update_interval": "Update-Intervall (Sekunden, 5-300)"
        }
      }
    }
  }
}